load-test/load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"

scenarios:
  - name: "Submit and poll echo job"
    flow:
      - post:
          url: "/jobs"
          headers:
            Content-Type: "application/json"
          json:
            type: "echo"
            payload:
              message: "load test"
          capture:
            - json: "$.id"
              as: "jobId"
      - get:
          url: "/jobs/{{ jobId }}"